Revit 2026 API

# FilteredElementCollectorFirstElement Method

---

Returns the first element to pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element FirstElement()
```
```vb
Public Function FirstElement As Element
```
```cpp
public:
Element^ FirstElement()
```
```fsharp
member FirstElement : unit -> Element
```

#### Return Value

Element The first element.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter. |

This will reset the collector to the beginning and find the first element that passes the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace